doc/lectures/annexe_cout_cin.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Écriture/lecture sur l&rsquo;entrée/sortie standard</title>
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="../stylesheets/styles.css">
                 <link rel="stylesheet" href="../stylesheets/org-pygments.css">
</head>
<body>
<div id="preamble" class="status">
</a><a href="lecture_pointeur.html">Pointeurs, références & allocation dynamique </a><a href="lecture_fonction.html">Rappels sur les fonctions </a><a href="lecture_specificite_c++.html">Les spécificités du C++ </a><a href="lecture_struct_class.html">Structures et classes </a><a href="lecture_encapsulation.html">Encapsulation des données </a><a href="lecture_constructeur.html">Notions de constructeur et de destructeur </a><a href="lecture_amitie.html">Fonctions et classes amies </a><a href="lecture_surcharge.html">Surcharge d'opérateur </a><a href="lecture_heritage.html">Héritage </a><a href="lecture_template.html">Notions de patrons de fonctions et de classes </a><a href="lecture_librairie_standard.html">Introduction à la librairie standard STL </a><a href=""></a><hr/><a href="annexe_compilation.html">Compilation et directives de préprocesseur </a><a href="annexe_convention_ecriture.html">Convention d'écriture et organisation des programmes </a><a href="annexe_cout_cin.html">Écriture/lecture sur l'entrée/sortie standard </a><a href="annexe_variable_statique.html">Les membres données statiques </a><a href="annexe_enum_typedef.html">Utilisation de enum et de typedef </a>
                    <hr/>
                    <a href="../../index.html">Retour menu principal</a>
</div>
<div id="content">
<h1 class="title">Écriture/lecture sur l&rsquo;entrée/sortie standard</h1><hr/>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">Rappel sur les fonction <code>printf</code> et <code>scanf</code> du C</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
<code>printf</code> et <code>scanf</code> sont deux fonctions de la bibliothèque standard du langage
C. Déclarée dans l&rsquo;entête <code>&lt;stdio.h&gt;</code>, <code>printf</code> permet l&rsquo;affichage d&rsquo;une chaîne
de caractère à l&rsquo;écran tandis que <code>scanf</code> est utilisée pour la saisie de données
formatées, qu&rsquo;il s&rsquo;agisse de lettres, de chiffres ou de chaînes de caractères.
</p>

<p>
Les prototypes de ces deux fonctions sont respectivement
</p>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">int</span> <span class="org-function-name">printf</span>(<span class="org-keyword">const</span> <span class="org-type">char</span> * <span class="org-variable-name">format</span>,...);
</pre>
</div>
<p>
et
</p>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">int</span> <span class="org-function-name">scanf</span>(<span class="org-keyword">const</span> <span class="org-type">char</span> * <span class="org-variable-name">format</span>,...);
</pre>
</div>
<p>
où :
</p>

<ul class="org-ul">
<li><code>const char * format</code> est une chaîne de caractère,</li>

<li><code>...</code> signifient que ces fonctions sont variadiques <i>i.e</i> que ces fonctions
peuvent un nombre variable de paramètres.</li>
</ul>

<p>
On peut ainsi écrire <code>printf</code> avec un seul paramètre :
</p>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;stdio.h&gt;</span>

<span class="org-type">int</span> <span class="org-function-name">main</span>()
{
  printf(<span class="org-string">"Votre chaine de caract&#232;res ici\n"</span>);
  <span class="org-keyword">return</span> 0;
}
</pre>
</div>
<p>
ou avec plusieurs paramètres
</p>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">  #include</span> <span class="org-string">&lt;stdio.h&gt;</span>

  <span class="org-type">int</span> <span class="org-function-name">main</span>()
  {
    <span class="org-type">int</span> <span class="org-variable-name">i</span> = 5;
    printf(<span class="org-string">"i =\n %d\n"</span>, i);
    <span class="org-keyword">return</span> 0;
}
</pre>
</div>
<p>
où <code>%d</code> est la spécification de format pour les entiers et <code>i</code> est son
argument. Le tableau <a href="#orgtable1">1</a> présente les différents formats en fonction
des types de variables.
</p>

<table id="orgtable1" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> <b>Format d'écriture en fonction du type de variable à afficher.</b></caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Format</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>int</code></td>
<td class="org-left"><code>%d</code></td>
</tr>

<tr>
<td class="org-left"><code>long</code></td>
<td class="org-left"><code>%ld</code></td>
</tr>

<tr>
<td class="org-left"><code>float/double</code></td>
<td class="org-left"><code>%f/%lf</code></td>
</tr>

<tr>
<td class="org-left"><code>char</code></td>
<td class="org-left"><code>%c</code></td>
</tr>

<tr>
<td class="org-left">string (<code>char*</code>)</td>
<td class="org-left"><code>%s</code></td>
</tr>

<tr>
<td class="org-left">pointeur (<code>void*</code>)</td>
<td class="org-left"><code>%p</code></td>
</tr>

<tr>
<td class="org-left">entier hexadécimal</td>
<td class="org-left"><code>%x</code></td>
</tr>
</tbody>
</table>

<p>
Pour la fonction <code>scanf</code>, la valeur retournée de type entier correspond le
nombre de variables affectées par la saisie et permet donc de vérifier que la
saisie s&rsquo;est correctement passée. En cas d’erreur de lecture, cette fonction
renvoie <code>EOF</code> et indique la raison de l’erreur dans la variable <code>errno</code>. Le code
ci-dessous présente un exemple d&rsquo;utilisation de la fonction <code>scanf</code>
</p>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;stdio.h&gt;</span>

<span class="org-type">int</span> <span class="org-function-name">main</span>()
{
  <span class="org-type">int</span> <span class="org-variable-name">nombre</span> = 0;
  <span class="org-type">int</span> <span class="org-variable-name">res</span> = 0;
  printf(<span class="org-string">"Entrez une valeur"</span>);
  res = scanf(<span class="org-string">"%d"</span>, &amp;nombre);
  <span class="org-keyword">if</span> (res == 1)
    printf(<span class="org-string">"Votre valeur est %d\n"</span>, nombre);
  <span class="org-keyword">else</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">traitement de l&#8217;erreur avec errno ou perror inclus dans errno.h</span>
  <span class="org-keyword">return</span> 0;
}
</pre>
</div>
<p>
La fonction <code>scanf</code> recopie la saisie de l&rsquo;utilisateur à une adresse
mémoire. Cette adresse doit être spécifiée dans la fonction <code>scanf</code> : la saisie
sera ainsi enregistrée à l&rsquo;adresse de la variable <code>nombre</code>, d’où la présence de
<code>&amp;</code> devant <code>nombre</code>).
</p>

<p>
Tout comme <code>printf</code> propose différents formats en fonction du type de variable,
il est possible de capturer plusieurs types de données avec la fonction
scanf (<i>cf.</i> Tableau <a href="#orgtable1">1</a>).
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2">Les nouvelles possibilités d&rsquo;entrée/sortie du C++</h2>
<div class="outline-text-2" id="text-orgheadline2">
<p>
Les commandes d&rsquo;entrée sortie <code>cout</code> / <code>cin</code> du C++ n&rsquo;ont <b>pas besoin de
spécification de format</b>, elles prennent en charge le formatage des variables à
afficher ou à affecter par l&rsquo;utilisateur.
</p>
</div>

<div id="outline-container-orgheadline3" class="outline-4">
<h4 id="orgheadline3">Syntaxe</h4>
<div class="outline-text-4" id="text-orgheadline3">
<div class="org-src-container">

<pre class="src src-c++">cout &lt;&lt; VariableAfficherNum1 &lt;&lt; VariableAfficherNum2 &lt;&lt;  ... ;
cin &gt;&gt; VariableA_AffecterNum1 &gt;&gt; VariableA_AffecterNum2 &gt;&gt; ... ;
</pre>
</div>

<p>
L&rsquo;opérateur <code>&lt;&lt;</code> ou <code>&gt;&gt;</code> indique la direction du flot de données: <code>&gt;&gt;</code> va dans
le sens de la lecture (occidentale) et va donc vers l&rsquo;ordinateur. À contrario,
<code>&lt;&lt;</code> sort de l&rsquo;ordinateur.
</p>

<p>
Exemple :
</p>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">const</span> <span class="org-type">int</span> <span class="org-variable-name">i</span> = 25;
<span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">f</span> = 4.52;
<span class="org-type">int</span> <span class="org-variable-name">j</span>;

cout &lt;&lt; <span class="org-string">"i = "</span> &lt;&lt; i &lt;&lt; endl &lt;&lt; <span class="org-string">"f = "</span> &lt;&lt; f;
cout &lt;&lt; endl &lt;&lt; <span class="org-string">"Entrer j"</span> &lt;&lt; endl;
cin &gt;&gt; j ;
</pre>
</div>
</div>
</div>


<div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4">Remarques</h4>
<div class="outline-text-4" id="text-orgheadline4">
<ul class="org-ul">
<li>La bibliothèque qui contient entre autre <code>cout</code> et <code>cin</code>
est <code>iostream</code>, il faut donc l&rsquo;inclure dans le programme par
<code>#include &lt;iostream&gt;</code>. Elle remplace la librairie standard
<code>stdio.h</code> utilisée en langage&nbsp;C.</li>

<li><p>
Il est nécessaire d&rsquo;ajouter au début du code la commande suivante
</p>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">using</span> <span class="org-keyword">namespace</span> <span class="org-constant">std</span>;
</pre>
</div>
<p>
pour utiliser les entrées-sorties directement via <code>cout=/=cin</code>. Sinon, il faut
utiliser l&rsquo;opérateur de portée <code>::</code> pour écrire <code>std::cout</code> (<i>cf.</i> <a href="lecture_specificite_c++.html">"Fiches sur
les spécificités du C++"</a>).
</p></li>

<li>Le saut de ligne caractérisé par la commande <code>\n</code> peut également être remplacé
par l&rsquo;opérateur <code>endl</code>. L&rsquo;utilisation de <code>endl</code> apporte une plus grande
lisibilité au code. Par ailleurs, la grande majorité des opérations liées à la
présentation (<code>\t</code> pour tabulation &#x2026;) sont regroupées dans la librairie
<code>iomanip</code>, la synthaxe propre au langage C restant, en tout état de cause,
valable.</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
